_conf = {}
# ==============================================================================
# 一般
# ==============================================================================
# 出力先ディレクトリ名
buildPathName = 'build'

# ==============================================================================
# 利用フラグ
# ==============================================================================
# 画像を圧縮するimgMinを利用するには
# gulp-imagemin
# imagemin-pngquant
# をインストールしてください。
#
_conf.useFlg =
	'coffee' : true
	'sass'   : true
	'imgMin' : false

# ==============================================================================
# パス
# ==============================================================================
# 開発
# ------------------------------------------------------------------------------
_conf.srcPath =
	'sass'   : './sass/'
	'scss'   : './sass/'
	'coffee' : './coffee/'
	'cache'  : './.cache/'

# ------------------------------------------------------------------------------
# 出力
# ------------------------------------------------------------------------------
_conf.buildPath =
	'css'  : '../'+buildPathName+'/css/'
	'img'  : '../'+buildPathName+'/img/'
	'font' : '../'+buildPathName+'/font/'
	'js'   : '../'+buildPathName+'/js/'

# ==============================================================================
# 設定
# ==============================================================================
# Compass
# ------------------------------------------------------------------------------
usrCompassConf    = require('../usr/compass.coffee')
_conf.compassConf =
	style       : 'expanded'
	relative    : true
	css         : _conf.buildPath.css
	image       : _conf.buildPath.img
	javascript  : _conf.buildPath.js
	font        : _conf.buildPath.font
	logging     : true
	require     : []
	import_path : usrCompassConf.import_path
	# 'sass'  : '', # sassは_buildで指定
# ------------------------------------------------------------------------------
# Pleeease
# ------------------------------------------------------------------------------
_conf.pleeeaseConf =
	autoprefixer   : { browsers : ['last 2 version'], cascade: true }
	filters        : { oldIE    : true }
	rem            : true
	opacity        : true
	pseudoElements : true
	mqpacker       : true
	colors         :
		color         : true
		hexAlpha      : true
		hwb           : true
		rebbecapurple : true
# ------------------------------------------------------------------------------
# CoffeeScript
# ------------------------------------------------------------------------------
_conf.coffeeConf =
	bare : true
# ------------------------------------------------------------------------------
# notify
# ------------------------------------------------------------------------------
_conf.notifyConf =
	sound : 'Glass'
# ------------------------------------------------------------------------------
# uglify
# ------------------------------------------------------------------------------
_conf.uglifyConf =
	mangle : true


# ==============================================================================
# モジュール登録
# ==============================================================================
module.exports = (type)->
	if _conf[type] is undefined
		console.log 'Warning : _conf.'+type+' was called for config.cofee. but, _conf.'+type+' is don\'t exist.'
	else
		return _conf[type]
	return